read_verilog and_gate.v
synth -top and_gate
write_json and_gate.json
